export const projects = [
  {
    id: "1",
    title: "Motion Quest",
    category: "Game",
    shortDesc: "เกมที่ผู้เล่นควบคุมตัวละครด้วยการเคลื่อนไหวร่างกายจริง ผ่านเทคโนโลยี Motion Detection",
    fullDesc: "Motion Quest เป็นเกมแนวตะลุยด่านพิชิตภารกิจที่ผู้เล่นควบคุมตัวละครด้วยการเคลื่อนไหวร่างกายจริง ผ่านเทคโนโลยี Motion Detection และกล้องเว็บแคม โดยพัฒนาด้วย Unity ร่วมกับ MediaPipe AI ที่สามารถตรวจจับจุดสำคัญของร่างกาย 33 จุด เช่น หัว ไหล่ มือ และเข่า เพื่อวิเคราะห์ท่าทางและถ่ายทอดสู่โมเดลในเกมแบบเรียลไทม์ ตัวเกมประกอบด้วย 3 มินิเกม ซึ่งผสมผสานความสนุก ความท้าทาย และการใช้ทักษะที่แตกต่างกัน ไม่ว่าจะเป็นการทำท่าทางให้เหมือนตามกำแพงที่เคลื่อนที่เข้ามาหา การหลบสิ่งกีดขวาง หรือการเคลื่อนไหวเพื่อตอบคำถาม โดยมีระบบอัลกอริทึมการนับคะแนนที่ประเมินจากความถูกต้องของท่าทาง ยิ่งผู้เล่นเคลื่อนไหวได้ตรงตามโจทย์ก็ยิ่งได้คะแนนสูงขึ้น Motion Quest จึงไม่ใช่แค่เกมเพื่อความบันเทิง แต่ยังช่วยฝึกความคิดสร้างสรรค์ การเรียนรู้เชิงรุก (Active Learning) ลดพฤติกรรมเนือยนิ่ง และส่งเสริมสุขภาพที่ดี เหมาะสำหรับบุคคลที่มองหาเกมสนุก ๆ พร้อมประโยชน์ในเวลาเดียวกัน",
    image: "https://i.ibb.co/Q3nr3Kvv/Screenshot-2025-10-05-15-15-54-964-cn-wps-moffice-eng-edit.jpg",
    tools: ["Unity", "Mediapipe", "Python", "Nomad"],
    year: "2025",
    awards: [
      "🏆 เข้ารอบชิงชนะเลิศ NSC2025 ประเภทโปรแกรมเพื่อความบันเทิง (ได้รับทุน 10,000 บาท)"
    ],
    // เพิ่มส่วนนี้
    myRole: [
      "เป็นหัวหน้าด้านพัฒนาโค้ด",
      "เชื่อมต่อ MediaPipe AI เข้ากับ Unity Engine",
      "ออกแบบและเขียนอัลกอริทึม"
    ]
  },
  {
    id: "2",
    title: "Lucky CAT Tech Solution",
    category: "Internship",
    shortDesc: "ฝึกงานตำแหน่ง Frontend Developer",
    fullDesc: "ผมได้ฝึกงานกับบริษัท Lucky Cat Tech Solution ในตำแหน่ง Frontend Developer โดยมีหน้าที่ออกแบบและพัฒนาเว็บไซต์ ตั้งแต่การออกแบบ UI/UX ด้วย Figma ไปจนถึงการพัฒนาเว็บจริงด้วย React, Next.js, JavaScript, CSS และ Tailwind CSS ได้เรียนรู้การทำงานร่วมกับทีม การรับฟัง และปรับแก้ไขงานตามคำแนะนำ รวมถึงการจัดการโครงสร้างโค้ด เพื่อให้เว็บไซต์สามารถใช้งานได้จริงอย่างมีประสิทธิภาพ และสวยงาม ซึ่งประสบการณ์ครั้งนี้ทำให้ผมเข้าใจงานในสาย Frontend Developer มากขึ้น และช่วยพัฒนาทักษะด้านการออกแบบและการพัฒนาเว็บให้ดียิ่งขึ้น",
    image: "https://i.ibb.co/RpxWRVSR/2025-10-04-013512.png",
    tools: ["React", "Next.js", "JavaScript", "Tailwind CSS"],
    year: "2024",
    awards: [],
    // เพิ่มส่วนนี้
    myRole: [
      "ออกแบบ UI/UX ของเว็บไซต์ด้วย Figma",
      "พัฒนา Frontend ด้วย React และ Next.js และอื่นๆ"
    ]
  },
  {
    id: "3",
    title: "Mini Aquarium",
    category: "IoT",
    shortDesc: " ตู้ปลาอัจฉริยะ เชื่อมต่อกับมือถือ",
    fullDesc: "ผมได้ทำโปรเจกต์ IoT ในชื่อ “Mini Aquarium ตู้ปลาอัจฉริยะ ซึ่งเป็นระบบที่ออกแบบมาเพื่อช่วยจัดการและดูแลตู้ปลาอย่างสะดวกและอัตโนมัติ โดยมีฟังก์ชันหลัก คือการให้อาหารปลาผ่านแอพพลิเคชันบนมือถือ การตรวจวัดอุณหภูมิของน้ำแบบเรียลไทม์ พร้อมแสดงผลทั้งบนบอร์ดและในแอพ หากอุณหภูมิของน้ำสูงหรือต่ำเกินกว่าที่เหมาะสม ไฟภายในตู้ปลาจะเปลี่ยนเป็นสีแดงเพื่อเตือน แต่ถ้าอยู่ในช่วงที่เหมาะสมไฟจะแสดงเป็นสีเขียว เพื่อบอกว่าสภาพแวดล้อมปกติ ประสบการณ์ครั้งนี้ทำให้ผมได้เรียนรู้การพัฒนา IoT จริงทั้งในด้าน ฮาร์ดแวร์ การประกอบวงจร การเชื่อมต่ออุปกรณ์ และด้านซอฟต์แวร์ การเขียนโค้ด การเชื่อมต่อแพลตฟอร์ม IoT และการออกแบบระบบให้ใช้งานได้จริง",
    image: "https://i.ibb.co/qLfgwSH7/2025-12-28-231645.png",
    tools: ["Microblock Ide", "Blynk", "Kidbright32ip"],
    year: "2024",
    awards: [
      "🥇 ได้รับรางวัลระดับเหรียญทอง กิจกรรมนวัตกรรมห้องเรียนพิเศษ"
    ],
    // เพิ่มส่วนนี้
    myRole: [
      "เป็นหัวหน้าทีม",
      "ต่ออุปกรณ์ต่างๆ เข้ากับบอร์ด",
      "พัพัฒนาแอปBlynkให้ทำงานร่วมกับบอร์ด"
      
    ]
  },
];